/*Задача 8*/
/* Напишите программу, которая выводит ваше любимое стихотворение, его автора и название. 
Для разбиения на строчки используйте подходящую управляющую последовательность (\n, \t и др.)) */

#include <iostream>
using namespace std;

int main()
{
    cout << "\tСергей Есенин — «Мне грустно на тебя смотреть...»\n\n";
    cout << "\t\tМне грустно на тебя смотреть,\n";
    cout << "\t\tКакая боль, какая жалость!\n";
    cout << "\t\tЗнать, только ивовая медь\n";
    cout << "\t\tНам в сентябре с тобой осталась.\n\n";

    cout << "\t\tЧужие губы разнесли\n";
    cout << "\t\tТвое тепло и трепет тела.\n";
    cout << "\t\tКак будто дождик моросит\n";
    cout << "\t\tС души, немного омертвелой...\n\n";

    cout << "\t\tНу что ж! Я не боюсь его.\n";
    cout << "\t\tИная радость мне открылась.\n";
    cout << "\t\tВедь не осталось ничего,\n";
    cout << "\t\tКак только жёлтый тлен и сырость.\n\n";

    cout << "\t\tВедь и себя я не сберёг\n";
    cout << "\t\tДля тихой жизни, для улыбок.\n";
    cout << "\t\tТак мало пройдено дорог,\n";
    cout << "\t\tТак много сделано ошибок.\n\n";

    cout << "\t\tСмешная жизнь, смешной разлад.\n";
    cout << "\t\tТак было и так будет после.\n";
    cout << "\t\tКак кладбище, усеян сад\n";
    cout << "\t\tВ берёз изглоданные кости.\n\n";

    cout << "\t\tВот так же отцветём и мы\n";
    cout << "\t\tИ отшумим, как гости сада…\n";
    cout << "\t\tКоль нет цветов среди зимы,\n";
    cout << "\t\tТак и грустить о них не надо.\n\n";
    return 0;   
}